app/controllers/articles_controller.rb

SELECT `articles`.* FROM `articles`
SELECT `lotto_results`.* FROM `lotto_results`
---
  def index
    @articles = Article.all
    generate_result
    @results = LottoResult.all

INSERT INTO `articles` (`title`, `text`, `created_at`, `updated_at`) VALUES ('Ahoi!', 'testing this first input', '2015-09-24 16:18:53', '2015-09-24 16:18:53')
---
  def create
    @article = Article.new(article_params)

    @article.save